In [4]:
import pandas as pd

In [6]:
data = {
    "Nombre": ["Juana", "Carla", "Rosa", "Maria"],
    "Edad": [20, 24, 32, 42],
    "Ciudad": ["Lima", "Iquitos", "Cusco", "Lambayeque"]
}
df = pd.DataFrame(data)
df

  Nombre  Edad      Ciudad
0  Juana    20        Lima
1  Carla    24     Iquitos
2   Rosa    32       Cusco
3  Maria    42  Lambayeque

In [8]:
df["Telefono"] = [894894, 98498489, 4894849, 89489489]

In [12]:
df

  Nombre  Edad      Ciudad  Telefono
0  Juana    20        Lima    894894
1  Carla    24     Iquitos  98498489
2   Rosa    32       Cusco   4894849
3  Maria    42  Lambayeque  89489489

In [14]:
df["Telefono"] = df["Telefono"] + 50

In [16]:
df

  Nombre  Edad      Ciudad  Telefono
0  Juana    20        Lima    894944
1  Carla    24     Iquitos  98498539
2   Rosa    32       Cusco   4894899
3  Maria    42  Lambayeque  89489539

In [18]:
nombres = df["Nombre"]
nombres

0    Juana
1    Carla
2     Rosa
3    Maria
Name: Nombre, dtype: object

In [20]:
mayores_25 = df[df["Edad"] > 25]
mayores_25

  Nombre  Edad      Ciudad  Telefono
2   Rosa    32       Cusco   4894899
3  Maria    42  Lambayeque  89489539

In [22]:
edades = df["Edad"]
edades

0    20
1    24
2    32
3    42
Name: Edad, dtype: int64

In [32]:
mayores_10 = df[edades > 40]
mayores_10

  Nombre  Edad      Ciudad  Telefono
3  Maria    42  Lambayeque  89489539

In [34]:
type(df)

pandas.core.frame.DataFrame

In [36]:
type(edades)

pandas.core.series.Series

In [38]:
type(mayores_10)

pandas.core.frame.DataFrame